-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Nov 07, 2022 at 02:29 PM
-- Server version: 10.4.25-MariaDB
-- PHP Version: 8.1.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `coffeemenu`
--

-- --------------------------------------------------------

--
-- Table structure for table `bansmenu`
--

CREATE TABLE `bansmenu` (
  `id` int(10) NOT NULL,
  `fname` varchar(255) NOT NULL,
  `description` varchar(255) NOT NULL,
  `details` varchar(255) NOT NULL,
  `img` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf32;

--
-- Dumping data for table `bansmenu`
--

INSERT INTO `bansmenu` (`id`, `fname`, `description`, `details`, `img`) VALUES
(5, 'กาแฟอราบิก้า (Arabica)', 'มีต้นกำเนิดของพันธุ์มาจากแอฟริกา', 'อาราบิก้า เป็นสายพันธุ์กาแฟที่ถูกค้นพบและมีการปลูกมาอย่างยาวนานถิ่นกำเนิดเริ่มต้นของกาแฟอาราบิก้านั้นถูกค้นพบที่ประเทศเอธิโอเปียบนเขตพื้นที่สูงซึ่งอยู่ในทวีปแอฟริกา เป็นที่นิยมไปทั่วโลกแบบที่สามารถเรียกได้ว่าเป็นพืชเศรษฐกิจของโลก ', '195486251.jpg'),
(6, 'สายพันธุ์โรบัสต้า (Robusta)', 'มีต้นกำเนิดของพันธุ์มาจากแอฟริกา', 'โรบัสต้าปลูกอยู่ทั่วไปใกล้บ้านของชนเผ่าบูโคบา ต้นกาแฟเหล่านี้มีอายุมากกว่า 100 ปี  โดยชนเผ่านี้ยึดถือประเพณีในพิธีสาบานเป็นพี่น้องกันจะต้องเอาเมล็ดกาแฟทั้งคู่จุ่มเลือดของแต่ละฝ่ายมาเคี้ยวกันคนละเมล็ด', '2029042260.jpg'),
(10, 'สายพันธ์ุกาแฟเอ็กซ์เซลซ่า (Excelsa)', 'ต้นกำเนิดมาจากเอเชียตะวันออกเฉียงใต้', 'กาแฟสายพันธุ์เอ็กซ์เซลซา (Excelsa) หรือชื่อวิทยาศาสตร์คือ Coffea excelsa เป็นสายพันธุ์กาแฟที่นิยมเพาะปลูกในแถบแอฟริกากลาง มีหลักฐานบันทึกไว้ว่าค้นพบครั้งแรกราวปี ค.ศ. 1903 และในปัจจุบันมีการเพาะปลูกกาแฟสายพันธุ์นี้อย่างแพร่หลายในประเทศเอเชียตะวันออกเฉียงใ', '758821981.jpg'),
(11, 'กาแฟลิเบอริก้า (Liberica)', 'มีต้นกำเนิดของพันธุ์มาจากแอฟริกา', 'กาแฟลิเบอริก้า (Liberica Coffee) เป็นสายพันธุ์กาแฟที่สามารถปลูกและดูแลได้ง่ายเหมือนกับโรบัสต้า มีต้นกำเนิดของพันธุ์มาจากแอฟริกา เป็นพันธุ์กาแฟพื้นเมืองของแองโกล่า ส่วนใหญ่จะไม่ค่อยมีการนำไลเบริก้าเพียงอย่างเดียวมาทำเป็นกาแฟสำหรับดื่ม เพราะคุณภาพของกาแฟไม่', '399276293.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `ingredient`
--

CREATE TABLE `ingredient` (
  `iding` int(10) NOT NULL,
  `ingname` varchar(255) NOT NULL,
  `ingdetail` varchar(500) NOT NULL,
  `img` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `ingredient`
--

INSERT INTO `ingredient` (`iding`, `ingname`, `ingdetail`, `img`) VALUES
(2, 'Espresso (เอสเพรสโซ)', 'ส่วนผสม  ผงกาแฟ 10-15 กรัม  วิธีทำ  ตักผงกาแฟใส่ก้านชง แล้วนำเข้าเครื่องชงกาแฟ  จากนั้นให้สกัดจนได้น้ำกาแฟเต็มแก้วที่เตรียมไว้ **นิยมเสิร์ฟเป็นเมนูร้อน**', '1173125967.jpg'),
(3, 'Americano (อเมริกาโน่)', 'ส่วนผสม (สูตร 12 ออนซ์)  ผงกาแฟ 10-15 กรัม  น้ำเปล่า 90 มิลลิลิตร น้ำแข็ง วิธีทำ  ตักผงกาแฟใส่ก้านชง แล้วให้นำเข้าเครื่องชง แล้วสกัดให้ได้กาแฟ 2 ช็อต เสร็จแล้วให้นำมาผสมกับน้ำเปล่า คนให้เข้ากัน ตักน้ำแข็งใส่ในแก้วที่เตรียมไว้ แล้วให้เทน้ำกาแฟที่ได้ลงไป เป็นอันเสร็จ ', '1836872409.jpg'),
(4, 'Latte (ลาเต้)', 'ส่วนผสม (สูตร 12 ออนซ์)  ผงกาแฟ 10-15 กรัม  นมสด 90 มิลลิลิตร น้ำแข็ง วิธีทำ  ตักผงกาแฟใส่ก้านชงนำเข้าเครื่องชงแล้วสกัดให้ได้กาแฟ 2 ช็อต แล้วเติมนมสดลงไป คนให้เข้ากัน เสร็จแล้วตักน้ำแข็งใส่แก้ว ค่อย ๆ เทส่สนผสมลงในแก้ว เป็นอันเสร็จ', '2025088482.jpg'),
(5, 'Cappuccino (คาปูชิโน)', 'ส่วนผสม (สูตร 12 ออนซ์)  ผงกาแฟ 10-15 กรัม  นมสด 60 มิลลิลิตร นมข้นหวาน 30 มิลลิลิตร ฟองนม น้ำแข็ง วิธีทำ  ตักผงกาแฟใส่ก้านชง แล้วนำเข้าเครื่องชงแล้วสกัดให้ได้กาแฟ 2 ช็อต จากนั้นให้เติมนมข้นหวานลงไป คนให้ละลายจนหมด เสร็จแล้วให้เติมนมสดลงไป คนให้เข้ากันอีกครั้ง ให้ตักน้ำแข็งใส่ในแก้ว แล้วเทส่วนผสมทั้งหมดลงในแก้ว เพิ่มฟองนมด้านบนเป็นอันเสร็จ', '944201270.jpg'),
(6, 'Mocha (มอคค่า)', 'ส่วนผสม (สูตร 12 ออนซ์)  ผงกาแฟ 10-15 กรัม ผงโกโก้ 1 ช้อนโต๊ะ (หรือผงช็อกโกแลต) นมสด 60 มิลลิลิตร นมข้นหวาน 30 มิลลิลิตร น้ำแข็ง วิธีทำ  ตักผงกาแฟใส่ก้านชงนำเข้าเครื่องชงแล้วสกัดให้ได้กาแฟ 2 ช็อต จากนั้นให้ตักผงโกโก้ใส่ลงไป คนให้ผงโกโก้ละลายจนหมด แล้วให้เติมนมข้นหวาน นมสดลงไป คนให้ละลายเข้าด้วยกันอีกครั้ง แล้วตักน้ำแข็งใส่ในแก้วที่เตรียมไว้ ค่อย ๆ เทส่วนผสมลงในแก้ว ', '42913632.jpg'),
(7, 'Macchiato (มัคคิอาโต้)', 'ส่วนผสม (สูตร 12 ออนซ์)  ผงกาแฟ 10-15 กรัม นมสด 60 มิลลิลิตร นมข้นหวาน 10 มิลลิลิตร คาราเมล 20 มิลลิลิตร น้ำแข็ง วิธีทำ  ตักผงกาแฟใส่ก้านชง แล้วนำเข้าเครื่องชงแล้วสกัดให้ได้กาแฟ 2 ช็อต เสร็จแล้วให้เติมนมข้นหวาน คาราเมลลงไป คนให้ละลายเข้ากันจนหมด ตักน้ำแข็งใส่ในแก้ว แล้วให้เทนมสดลงในแก้ว  แล้วเทส่วนผสมทั้งหมดตามลงไปลงในแก้ว เท่านี้ก็พร้อมเสิร์ฟแล้ว ', '1826512860.jpg'),
(8, 'กาแฟโบราณ', 'ส่วนผสม (สูตร 12 ออนซ์)  ผงกาแฟโบราณ 1 ช้อนโต๊ะ น้ำร้อน 120 มิลลิลิตร นมข้นหวาน 30 มิลลิลิตร นมสด 30 มิลลิลิตร น้ำแข็ง วิธีทำ  เทน้ำร้อนใส่ผงกาแฟโบราณ แช่ทิ้งไว้ 1 นาที เสร็จแล้วให้กรองกากออก จากนั้นให้นำมาผสมกับนมข้นหวาน คนให้ละลายเข้ากัน แล้วเติมนมสดลงไป คนอีกครั้งให้เข้ากัน แล้วตักน้ำแข็งใส่ในแก้ว ค่อย ๆ เทส่วนผสมลงไป เป็นอันเสร็จ ', '1350453967.jpg');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `bansmenu`
--
ALTER TABLE `bansmenu`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `ingredient`
--
ALTER TABLE `ingredient`
  ADD PRIMARY KEY (`iding`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `bansmenu`
--
ALTER TABLE `bansmenu`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT for table `ingredient`
--
ALTER TABLE `ingredient`
  MODIFY `iding` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
